# CutOverallWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..CutOverallWidth Property
FabricSheet Class See Also
---
The sheet length after cutting has taken place.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CutOverallWidth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutOverallWidth As Double
	Get
```

Visual C++
---
```text
public:
property double CutOverallWidth {
	double get ();
}
```

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace